0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    bottom1
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    bottom2
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    front
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    back
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    leftwall
    {
        type            fixedValue;
        value           uniform 0.03;
    }



    rightwall
    {
        type            zeroGradient;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

}


// ************************************************************************* //
