0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    bottom1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    bottom2
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    front
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    back
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    leftwall
    {
        type            calculated;
        value           uniform 0;

    }

    rightwall
    {
        type            zeroGradient;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }


}


// ************************************************************************* //
