constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bottom1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          88000;
        startFace       23437525;
    }
    bottom2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          88000;
        startFace       23525525;
    }
    front
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144000;
        startFace       23613525;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144000;
        startFace       23757525;
    }
    leftwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2475;
        startFace       23901525;
    }
    rightwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2475;
        startFace       23904000;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          176000;
        startFace       23906475;
    }
)

// ************************************************************************* //
